// 定数は大文字 スネークケースでかく
const API_KYE

// 質問・オブジェクトで書かない書き方とは

// jqueryはどこにどんなイベントが設定されているかわかりずらい
// js-とクラスでつけるとjsの機能をもつクラスと判断できる
// →メンテナンス性が上がる

// on”click”の後にセレクターを指定すると宣言時にいなくても大丈夫

// レンダリングと表示処理を分離

// mapで別配列を作成

// url_sでurlkらパラメータを取得できる


// 配列をjoinで文字列に
// appendよりhtmlを一括で変更をさせる方がパフォーマンスが上がる

// min
// max

// aria-selectedとは

// 情報は別で管理する

// dataの取得とレンダリング(描画)ロジックは分ける


// async関数は awaitの処理が終わるまで待ってくれる

// prototype ベースから classベースになった

// aria-current="page"
// ↑イケてる
// あとで目を通す

// yahoo 関連キーワード api

// サジェストのフィルタリング